Tekla Open API Reference for Tekla Structures 2025
Double.CompareTo Method
 Compares the current object with another object of the same type.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int CompareTo(
	Double other
)
Public Function CompareTo (
	other As Double
) As Integer
Parameters
other
Type: Tekla.Structures.Datatype.Double
The object to be compared with the current object.
Return Value
Type: Int32
A 32-bit signed integer that indicates the relative order of the objects being compared.
The return value has the following meanings:
Value | Meaning
Less than zero | The current object is less than the other object.
Zero | The current object is equal to the other object.
Greater than zero | The current object is greater than the other object.
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace